<?php

header("Content-Type: text/html; charset=utf-8");

//$origins=$_GET['origin'];
$origins="11、言者无罪，闻者足戒。 （诗经?大序）
14、高岸为谷，深谷为陵。 （诗经?小雅）
15、他山之石，可以攻玉。 （诗经?小雅?鹤鸣）
16、靡不有初，鲜克有终。 （诗经?大雅?荡）
17、投我以桃，报之以李。 （诗经?大雅?抑）
26、言之无文，行而不远。 （左传）
29、居安思危，思则有备，有备无患。 （左传）
33、知足不辱，知止不殆。 （老子）
35、将欲取之，必先之。 （老子）
39、大直若屈，大巧若拙，大辩若讷。 （老子）
46、敏而好学，不耻下问。 （论语?公冶长）
53、往者不可谏，来着犹可追。 （论语?微子）
57、知者不惑，仁者不忧，勇者不惧。 （论语?子罕）
58、三军可夺帅也，匹夫不可夺志也。 （论语?子罕）
69、玉不琢，不成器；人不学，不知道。 （礼记?学记）
70、使老有所终，壮有所用，幼有所长，鳏寡孤独废疾者皆有所养。 （礼记?礼运）
71、同声相应，同气相求。 （易经?乾）
76、亦余心之所善兮，虽九死其犹未悔。 （屈原?离骚）
78、吾不能变心以从俗兮，故将愁苦而终穷。 （屈原?涉江）
79、余将董道而不豫兮，固将重昏而终身。 （屈原?涉江）
80、苟余心之端直兮，虽僻远其何伤？ （屈原?涉江）
94、持之有故，言之成理。 （荀子?非十二子）
106、塞翁失马，焉知非福。 （淮南子?人间训）
109、流水不腐，户枢不蠹。 （吕氏春秋?尽数）
122、众口铄金，积毁销骨。 （史记?张仪列传）
128、人固有一死，或重于泰山，或轻于鸿毛。 （史记?报任少卿书）
130、绳锯木断，水滴石穿。 （汉书?枚乘传）
134、人生有新故，贵贱不相逾。 （汉?辛延年?羽林郎）
142、志士不饮盗泉之水，廉者不受嗟来之食。 （后汉书）
145、捐躯赴国难，视死忽如归。 （三国?曹植?白马篇）
147、鞠躬尽瘁，死而后已。 （三国?诸葛亮?后出师表）
153、国以民为本，民以食为天。 （西晋?陈寿?三国志）
159、羁鸟恋旧林，池鱼思故渊。 （东晋?陶渊明?归园田居其一）
163、盛年不重来，一日难再晨。 （东晋?陶渊明?杂诗）
165、木欣欣以向荣，泉涓涓而始流。 （东晋?陶渊明?归去来兮辞）
167、管中窥豹，时见一斑。 （晋书?王献之传）
168、笼天地于形内，挫万物于笔端。 （晋?陆机?文赋）
173、句有可削，足见其疏；字不得减，乃知其密。 （南朝?刘勰?文心雕龙）
174、黯然销魂者，惟别而已矣。 （南朝?江淹?别赋）
182、相顾无相识，长歌怀采薇。 （唐?王绩?野望）
183、西塞山前白鹭飞，桃花流水鳜鱼肥。 （唐?张志和?渔父）
194、海上生明月，天涯共此时。 （唐?张九龄?望月怀远）
195、思君如满月，夜夜减清辉。 （唐?张九龄?赋得自君之出矣）
198、绿树村边合，青山郭外斜。 （唐?孟浩然?过故人庄）
204、江流天地外，山色有无中。 （唐?王维?汉江临泛）
205、明月松间照，清泉石上流。 （唐?王维?山居秋暝）
207、行到水穷处，坐看云起时。 （唐?王维?终南别业）
208、草枯鹰眼疾，雪尽马蹄轻。 （唐?王维?观猎） 
209、大漠孤烟直，长河落日圆。 （唐?王维?使至塞上）
210、月出惊山鸟，时鸣春涧中。 （唐?王维?鸟鸣涧）
212、独在异乡为异客，每逢佳节倍思亲。 （唐?王维?九月九日忆山东兄弟）
217、浮云游子意，落日故人情。 （唐?李白?送友人）
218、相看两不厌，只有敬亭山。 （唐?李白?独坐敬亭山）
220、山随平野尽，江入大荒流。 （唐?李白?渡荆门送别）
221、秋风吹不尽，总是玉关情。 （唐?李白?子夜吴歌）
226、大鹏一日同风起，扶摇直上九万里。 （唐?李白?上李邕）
228、俱怀逸兴壮思飞，欲上青天揽明月。 （唐?李白?宣州谢朓饯别校书叔云）
229、仰天大笑出门去，我辈岂是蓬蒿人。 （唐?李白?南陵别儿童入京） 
232、两岸青山相对出，孤帆一片日边来。 （唐?李白?望天门山）
234、长风破浪会有时，直挂云帆济沧海。 （唐?李白?行路难）
235、兴酣落笔摇五岳，诗成笑傲凌沧海。 （唐?李白?江上吟）
236、停杯投箸不能食，拔剑四顾心茫然。 （唐?李白?行路难）
237、欲渡黄河冰塞川，将登太行雪满山。 （唐?李白?行路难）
238、黄河捧土尚可塞，北风雨雪恨难裁。 （唐?李白?北风行）
239、我寄愁心与明月，随风直到夜郎西。 （唐?李白?闻王昌龄左迁龙标，遥有此寄）
240、请君试问东流水，别意与之谁短长。 （唐?李白?金陵酒肆留别） 
241、三山半落青山外，一水中分白鹭洲。 （唐?李白?登金陵凤凰台）
243、云想衣裳花想容，春风拂槛露华浓。 （唐?李白?清平调）
247、晴川历历汉阳树，芳草萋萋鹦鹉洲。 （唐?崔颢?黄鹤楼）
248、纵使晴明无雨色，入云深处亦沾衣。 （唐?张旭?山中留客）
251、拜迎长官心欲碎，鞭挞黎庶令人悲。 （唐?高适?封丘县） 
258、香雾云鬟湿，清辉玉臂寒。 （唐?杜甫?月夜）
265、白也诗无敌，飘然思不群。 （唐?杜甫? 春日忆李白）
266、露从今夜白，月是故乡明。 （唐?杜甫?月夜忆舍弟 ）
267、笔落惊风雨，诗成泣鬼神。 （唐?杜甫?寄本十二白二十 ）
268、文章千古事，得失寸心知。 （唐?杜甫?偶题）
269、敏捷诗千首，飘零酒一杯。 （唐?杜甫? 不见）
270、星随平野阔，月涌大江流。 （唐?杜甫?旅夜书怀）
271、新松恨不高千尺，恶竹应须斩万竿。 （唐?杜甫）
272、万里悲秋常作客，百年多病独登台。 （唐?杜甫?登高）
274、为人性僻耽佳句，语不惊人死不休。 （唐?杜甫?江上值水如海势聊短述）
275、尔曹身与名俱灭，不废江河万古流。 （唐?杜甫?戏为六绝句）
276、窗含西岭千秋雪，门泊东吴万里船。 （唐?杜甫?绝句）
278、出师未捷身先死，长使英雄泪沾襟。 （唐?杜甫?蜀相）
279、思家步月清宵立，忆弟看云白日眠。 （唐?杜甫?恨别）
280、正是江南好风景，落花时节又逢君。 （唐?杜甫?江南逢李龟年）
281、流连戏蝶时时舞，自在娇莺恰恰啼。 （唐?杜甫?江畔独步寻花）
284、穿花蛱蝶深深见，点水蜻蜓款款飞。 （唐?杜甫?曲江）
285、酒债寻常行处有，人生七十古来稀。 （唐?杜甫?曲江）
286、白日放歌须纵酒，青春作伴好还乡。 （唐?杜甫?闻官军收河南河北）
288、马上相逢无纸笔，凭君传语报平安。 （唐?岑参?逢入京使）
292、春城无处不飞花，寒食东风御柳斜。 （唐?韩翃?寒食）
294、春风得意马蹄疾，一日看尽长安花。 （唐?孟郊?登科后）
295、若待上林花似锦，出门俱是看花人。 （唐?杨巨源?城东早春）
302、不塞不流，不止不行。 （唐?韩愈?原道）
304、蚍蜉撼大树，可笑不自量。 （唐?韩愈?调张籍）
307、云横秦岭家何在，雪拥蓝关马不前。 （唐?韩愈?左迁至蓝关示孙湘）
309、世有伯乐，然后有千里马。千里马常有，而伯乐不常有。 （唐?韩愈?马说） 
313、东边日出西边雨，道是无晴却有晴。 （唐?刘禹锡?竹枝）
314、千淘万漉虽辛苦，吹尽狂沙始到金。 （唐?刘禹锡?浪淘沙）
315、遥望洞庭山水色，白银盘里一青螺。 （唐?刘禹锡?望洞庭）
326、别有幽愁暗恨生，此时无声胜有声。 （ 唐?白居易?琵琶行）
332、桑柘影斜春社散，家家扶得醉人归。 （ 唐?王驾?社日）
333、曾经沧海难为水，除却巫山不是云。 （ 唐?元稹?离思）
334、溪云初起日沉阁，山雨欲来风满楼。 （ 唐?许浑?咸阳城西楼晚眺）
335、水晶帘动微风起，满架蔷薇一院香。 （ 唐?高骈?山亭夏日）
336、年年岁岁花相似，岁岁年年人不同。 （ 唐?刘希夷）
338、黑发不知勤学早，白首方悔读书迟。 （ 唐?颜真卿）
339、采得百花成蜜后，为谁辛苦为谁甜。 （ 唐?罗隐?蜂）
340、日斜深巷无人迹，时见梨花片片开。 （ 唐?戴叔伦?过柳溪道院）
341、鸟宿池边树，僧敲月下门。 （ 唐?贾岛?题李凝幽居）
342、十年磨一剑，霜刃未曾试。 （ 唐?贾岛?剑客）
345、大漠沙如雪，燕山月似钩。 （唐?李贺?马诗）
346、男儿何不带吴钩，收取关山五十州。 （唐?李贺?南国）
347、不见年年辽海上，文章何处哭秋风。 （唐?李贺?南国）
348、昆山玉碎凤凰叫，芙蓉泣露香兰笑。 （唐?李贺?李凭箜篌引）
349、女娲炼石补天处，石破天惊逗秋雨。 （唐?李贺?李凭箜篌引）
350、我有迷魂招不得，雄鸡一声天下白。 （唐?李贺?致酒行）
353、二十四桥明月夜，玉人何处教吹箫。 （唐?杜牧?寄扬州韩判官）
356、天阶夜色凉如水，卧看牵牛织女星。 （唐?杜牧?秋夕）
358、十年一觉扬州梦，赢得青楼薄倖名。 （唐?杜牧?遣怀）
359、烟笼寒水月笼沙，夜泊秦淮近酒家。 （唐?杜牧?泊秦淮）
363、相见时难别亦难，东风无力百花残。 （唐?李商隐?无题）
364、青女素娥俱耐冷，月中霜里斗婵娟。 （唐?李商隐?霜月）
365、庄生晓梦迷蝴蝶，望帝春心托杜鹃。 （唐?李商隐?锦瑟）
367、春心莫共花争发，一寸相思一寸灰。 （唐?李商隐）
368、历鉴前朝国与家，成由勤俭败由奢。 （唐?李商隐）
369、桐花万里丹山路，雏凤清于老凤声。 （唐?李商隐）
371、天意怜幽草，人间重晚晴。 （唐?李商隐?晚晴）
372、风暖鸟声碎，日高花影重。 （唐?杜荀鹤?春宫怨）
374、多情只有春庭月，犹为离人照落花。 （唐?张泌?寄人）
375、海阔凭鱼跃，天高任鸟飞。 （唐?僧?云览）
378、昨夜西风凋碧树，独上高楼，望尽天涯路。 （宋? 晏殊?蝶恋花）
380、梨花院落溶溶月，柳絮池塘淡淡风。 （宋? 晏殊?寓意）
381、疏影横斜水清浅，暗香浮动月黄昏。 （宋?林逋?山园小梅）
382、沙上并禽池上暝，云破月来花弄影。 （宋?张先?天仙子）
383、先天下之忧而忧，后天下之乐而乐。 （宋?范仲淹?岳阳楼记）
385、残雪压枝犹有桔，冻雷惊笋欲抽芽。 （宋?欧阳修?戏答元珍）
386、泪眼问花花不语，乱红飞过秋千去。 （宋?欧阳修?蝶恋花）
387、忧劳可以兴国，逸豫可以亡身。 （宋?欧阳修?伶官传序）
388、祸患常积于忽微，而智勇多困于所溺。 （宋?欧阳修?伶官传序）
389、雪消门外千山绿，花发江边二月晴。 （宋?欧阳修）
392、多情自古伤离别，更那堪冷落清秋节。 （宋?柳永?雨霖铃）
393、今宵酒醒何处，杨柳岸晓风残月。 （宋?柳永?雨霖铃）
394、兼听则明，偏信则暗。 （宋?司马光? 资治通鉴）
395、由俭入奢易，由奢入俭难。 （宋?司马光? 训俭示康）
396、鉴前世之兴衰，考当今之得失。 （宋?司马光?资治通鉴）
397、循序而渐进，熟读而精思。 （宋?朱熹?读书之要）
398、即以其人之道，还治其人之身。 （宋?朱熹?中庸集注）
401、要看银山排天浪，开窗放入大江来。 （宋?曾公亮?宿甘露寺僧舍）
402、不畏浮云遮望眼，只缘身在最高层。 （宋?王安石?登飞来峰）
403、春风又绿江南岸，明月何时照我还。 （宋?王安石?泊船瓜州）
404、千门万户曈曈日，总把新桃换旧符。 （宋?王安石?元日）
405、看似寻常最奇崛，成如容易却艰辛。 （宋?王安石） 
406、一年好景君须记，最是橙黄橘绿时。 （宋?苏轼? 赠刘景文）
407、枝上柳绵吹又少，天涯何处无芳草。 （宋?苏轼?蝶恋花）
409、荷尽已无擎雨盖，菊残犹有傲霜枝。 （宋?苏轼?冬景）
412、旧书不厌百回读，熟读深思子自知。 （宋?苏轼）
414、博观而约取，厚积而薄发。 （宋?苏轼）
417、大江东去，浪淘尽，千古风流人物。 （宋?苏轼?念奴娇?赤壁之战）
418、晚泊孤舟古祠下，满川风雨看潮生。 （宋?苏舜钦?淮中晚泊犊头）
419、残雪暗随冰笋滴，新春偷向柳梢归。 （宋?张耒?春日）
420、天接云涛连晓雾，星河欲转千帆舞。 （宋?李清照?渔家傲）
422、物是人非事事休，欲语泪先流。 （宋?李清照?五陵春）
424、莫道不销魂，帘卷西风，人比黄花瘦。 （宋?李清照?醉花阴）
425、花自飘零水自流，一种相思，两处闲愁。 （宋?李清照?如梦令）
427、有情芍药含春泪，无力蔷薇卧晓枝。 （宋?秦观?春日）
428、文章本天成，妙手偶得之。 （宋?陆游?文章）
432、位卑未敢忘忧国，事定犹须待阖棺。 （宋?陆游? 病起书怀）
435、小楼一夜听风雨，深巷明朝卖杏花。 （宋?陆游?临安春雨初霁）
440、接天莲叶无穷碧，映日荷花别样红。 （宋?杨万里?晓出净慈寺送林子方）
441、月子弯弯照九州，几家欢乐几家愁。 （宋?杨万里?竹枝词）
443、绿杨烟外晓寒轻，红杏枝头春意闹。 （宋?宋祁?玉楼春）
446、臣心一片磁针石，不指南方不肯休。 （宋?文天祥?扬子江）
447、山外青山楼外楼，西湖歌舞几时休。 （宋?林升?题临安邸）
448、沾衣欲湿杏花雨，吹面不寒杨柳风。 （宋?志南） 
449、风日晴和人意好，夕阳箫鼓几船归。 （宋?徐元杰?湖上）
450、近水楼台先得月，向阳花木易为春。 （宋?俞文豹?清夜录）
451、梅须逊雪三分白，雪却输梅一段香。 （宋?卢梅坡?雪梅）
452、风流不在谈锋胜，袖手无言味最长。 （宋?黄昇?鹧鸪天）
453、青山遮不住，毕竟东流去。 （宋?辛弃疾?菩萨蛮）
454、明月别枝惊鹊，清风半夜鸣蝉。 （宋?辛弃疾?西江月）
455、事如芳草春长在，人似浮云影不留。 （宋?辛弃疾?鹧鸪天）
457、想当年，金戈铁马，气吞万里如虎。 （宋?辛弃疾?永遇乐?京口北固亭怀古）
458、千古兴亡多少事，悠悠。不尽长江滚滚流。 （宋?辛弃疾?南乡子）
459、二十四桥仍在，波心荡，冷月无声。 （宋?姜夔?扬州慢）
460、莫等闲，白了少年头，空悲切。 （宋?岳飞?满江红）
463、着意栽花花不发，无意插柳柳成阴。 （元?关汉卿）
464、枯藤老树昏鸦，小桥流水人家，古道西风瘦马。夕阳西下，断肠人在天涯。（ 元?马致远?天净沙?秋思）
465、晓来谁染霜林醉？总是离人泪。 （元?王实甫?西厢记）
466、花落水流红，闲愁万种，无语怨东风。 （元?王实甫?西厢记）
";

if(strlen($origins)==0){
	echo -1;
}else{
	$lineOrigins=explode("、",$origins);
	if($lineOrigins){
		foreach ($lineOrigins as $key => $value) {
			if(strlen($value)!=0){
				$test=delNum(delBrackets($value))."<br>";
				if($test){
					echo $test."\r\n";
				}else{
					echo "-2";
					break;
				}
			}else{
				echo "-3";
				break;
			}
		}
	}else{
		echo "-3";
	}

}

function delBrackets($str){
	$pos=stripos($str,"（");
	$str=substr($str,0,$pos);
	return $str;
}

function delNum($str){
	$pos=stripos($str,"、");
	$str=substr($str,$pos);
	return $str;
}

?>
